system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 2.16 -1.83 -1.22) // 0
    ( 2.16  1.83 -1.22) // 1
    (-1.52  1.83 -1.22) // 2
    (-1.52 -1.83 -1.22) // 3
    ( 2.16 -1.83  1.22) // 4
    ( 2.16  1.83  1.22) // 5
    (-1.52  1.83  1.22) // 6
    (-1.52 -1.83  1.22) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    ({nx} {ny} {nz})
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {{
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }}

    outlet
    {{
	type patch;
	faces
        (
            (0 4 5 1)
        );
    }}

    walls
    {{
	type wall;
        faces
        (
            (1 5 6 2)
            (4 0 3 7)
        );
    }}

    top
    {{
	type wall;
	faces
        (
            (4 7 6 5)
        );
    }}

    bottom
    {{
	type wall;
        faces
        (
            (0 1 2 3)
        );
    }}
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
