system/NACA0021_1.6e5
// Data from Sheldahl and Klimas
// Re = 1.6e5
// cm from Re = 3.6e5 dataset
// Reformatted with foamPy
// alpha_deg cl cd cm
(-180.0 -0.0 0.025 -0.025)
(-175.0 0.66 0.055 0.28)
(-170.0 0.85 0.14 0.42)
(-165.0 0.68 0.23 0.275)
(-160.0 0.635 0.32 0.285)
(-155.0 0.67 0.42 0.325)
(-150.0 0.77 0.575 0.35)
(-145.0 0.9 0.755 0.5)
(-140.0 0.98 0.925 0.4)
(-135.0 0.93 1.085 0.42)
(-130.0 0.85 1.225 0.41)
(-125.0 0.76 1.35 0.47)
(-120.0 0.67 1.465 0.56)
(-115.0 0.575 1.555 0.54)
(-110.0 0.45 1.635 0.49)
(-105.0 0.32 1.7 0.275)
(-100.0 0.185 1.75 0.45)
(-95.0 0.05 1.78 0.28)
(-90.0 -0.09 1.8 0.5)
(-85.0 -0.23 1.8 0.46)
(-80.0 -0.365 1.78 0.26)
(-75.0 -0.5 1.735 0.48)
(-70.0 -0.63 1.665 0.15)
(-65.0 -0.76 1.575 0.46)
(-60.0 -0.875 1.47 0.4)
(-55.0 -0.955 1.345 0.35)
(-50.0 -1.02 1.215 0.34)
(-45.0 -1.05 1.075 0.225)
(-40.0 -1.035 0.92 0.1)
(-35.0 -0.98 0.745 0.08)
(-30.0 -0.855 0.57 0.08)
(-25.0 -0.6664 0.405 0.075)
(-22.0 -0.6023 0.329 0.066)
(-21.0 -0.5972 0.3055 0.063)
(-20.0 -0.592 0.282 0.06)
(-19.0 -0.6009 0.26 0.06)
(-18.0 -0.6098 0.238 0.06)
(-17.0 -0.6293 0.217 0.06)
(-16.0 -0.6487 0.196 -0.0)
(-15.0 -0.674 0.177 -0.04)
(-14.0 -0.6993 0.158 -0.035)
(-13.0 -0.7255 0.086 -0.032)
(-12.0 -0.7363 0.0292 -0.03)
(-11.0 -0.7443 0.0266 -0.03)
(-10.0 -0.7374 0.0243 -0.03)
(-9.0 -0.7148 0.0222 -0.03)
(-8.0 -0.6745 0.0204 -0.03)
(-7.0 -0.6209 0.0187 -0.03)
(-6.0 -0.5486 0.0174 -0.03)
(-5.0 -0.4687 0.0163 -0.0)
(-4.0 -0.38 0.0155 -0.0)
(-3.0 -0.2861 0.0148 -0.0)
(-2.0 -0.1879 0.0143 -0.0)
(-1.0 -0.0842 0.014 -0.0)
(0.0 0.0 0.0139 0.0)
(1.0 0.0842 0.014 0.0)
(2.0 0.1879 0.0143 0.0)
(3.0 0.2861 0.0148 0.0)
(4.0 0.38 0.0155 0.0)
(5.0 0.4687 0.0163 0.0)
(6.0 0.5486 0.0174 0.03)
(7.0 0.6209 0.0187 0.03)
(8.0 0.6745 0.0204 0.03)
(9.0 0.7148 0.0222 0.03)
(10.0 0.7374 0.0243 0.03)
(11.0 0.7443 0.0266 0.03)
(12.0 0.7363 0.0292 0.03)
(13.0 0.7255 0.086 0.032)
(14.0 0.6993 0.158 0.035)
(15.0 0.674 0.177 0.04)
(16.0 0.6487 0.196 0.0)
(17.0 0.6293 0.217 -0.06)
(18.0 0.6098 0.238 -0.06)
(19.0 0.6009 0.26 -0.06)
(20.0 0.592 0.282 -0.06)
(21.0 0.5972 0.3055 -0.063)
(22.0 0.6023 0.329 -0.066)
(25.0 0.6664 0.405 -0.075)
(30.0 0.855 0.57 -0.08)
(35.0 0.98 0.745 -0.08)
(40.0 1.035 0.92 -0.1)
(45.0 1.05 1.075 -0.225)
(50.0 1.02 1.215 -0.34)
(55.0 0.955 1.345 -0.35)
(60.0 0.875 1.47 -0.4)
(65.0 0.76 1.575 -0.46)
(70.0 0.63 1.665 -0.15)
(75.0 0.5 1.735 -0.48)
(80.0 0.365 1.78 -0.26)
(85.0 0.23 1.8 -0.46)
(90.0 0.09 1.8 -0.5)
(95.0 -0.05 1.78 -0.28)
(100.0 -0.185 1.75 -0.45)
(105.0 -0.32 1.7 -0.275)
(110.0 -0.45 1.635 -0.49)
(115.0 -0.575 1.555 -0.54)
(120.0 -0.67 1.465 -0.56)
(125.0 -0.76 1.35 -0.47)
(130.0 -0.85 1.225 -0.41)
(135.0 -0.93 1.085 -0.42)
(140.0 -0.98 0.925 -0.4)
(145.0 -0.9 0.755 -0.5)
(150.0 -0.77 0.575 -0.35)
(155.0 -0.67 0.42 -0.325)
(160.0 -0.635 0.32 -0.285)
(165.0 -0.68 0.23 -0.275)
(170.0 -0.85 0.14 -0.42)
(175.0 -0.66 0.055 -0.28)
(180.0 0.0 0.025 0.025)
