system/NACA0021_multiRe_cm
// From Sheldahl and Klimas (1981)
// C_m data only from Re_c = 3.6e5 and 6.8e5
// Re_c = 40000 80000 160000 360000 700000 1000000 2000000 5000000
// alpha_deg
(-180.0 -0.0250 -0.0250 -0.0250 -0.0250 0.0600 0.0600 0.0600 0.0600)
(-175.0 0.2800 0.2800 0.2800 0.2800 0.3100 0.3100 0.3100 0.3100)
(-170.0 0.4200 0.4200 0.4200 0.4200 0.4250 0.4250 0.4250 0.4250)
(-165.0 0.2750 0.2750 0.2750 0.2750 0.3500 0.3500 0.3500 0.3500)
(-160.0 0.2850 0.2850 0.2850 0.2850 0.3000 0.3000 0.3000 0.3000)
(-155.0 0.3250 0.3250 0.3250 0.3250 0.3300 0.3300 0.3300 0.3300)
(-150.0 0.3500 0.3500 0.3500 0.3500 0.3800 0.3800 0.3800 0.3800)
(-145.0 0.5000 0.5000 0.5000 0.5000 0.3800 0.3800 0.3800 0.3800)
(-140.0 0.4000 0.4000 0.4000 0.4000 0.4750 0.4750 0.4750 0.4750)
(-135.0 0.4200 0.4200 0.4200 0.4200 0.5250 0.5250 0.5250 0.5250)
(-130.0 0.4100 0.4100 0.4100 0.4100 0.4400 0.4400 0.4400 0.4400)
(-125.0 0.4700 0.4700 0.4700 0.4700 0.4900 0.4900 0.4900 0.4900)
(-120.0 0.5600 0.5600 0.5600 0.5600 0.5400 0.5400 0.5400 0.5400)
(-115.0 0.5400 0.5400 0.5400 0.5400 0.3900 0.3900 0.3900 0.3900)
(-110.0 0.4900 0.4900 0.4900 0.4900 0.1900 0.1900 0.1900 0.1900)
(-105.0 0.2750 0.2750 0.2750 0.2750 0.4500 0.4500 0.4500 0.4500)
(-100.0 0.4500 0.4500 0.4500 0.4500 0.4500 0.4500 0.4500 0.4500)
(-95.0 0.2800 0.2800 0.2800 0.2800 0.4150 0.4150 0.4150 0.4150)
(-90.0 0.5000 0.5000 0.5000 0.5000 0.4200 0.4200 0.4200 0.4200)
(-85.0 0.4600 0.4600 0.4600 0.4600 0.3800 0.3800 0.3800 0.3800)
(-80.0 0.2600 0.2600 0.2600 0.2600 0.2100 0.2100 0.2100 0.2100)
(-75.0 0.4800 0.4800 0.4800 0.4800 0.3000 0.3000 0.3000 0.3000)
(-70.0 0.1500 0.1500 0.1500 0.1500 0.4100 0.4100 0.4100 0.4100)
(-65.0 0.4600 0.4600 0.4600 0.4600 0.1500 0.1500 0.1500 0.1500)
(-60.0 0.4000 0.4000 0.4000 0.4000 0.2700 0.2700 0.2700 0.2700)
(-55.0 0.3500 0.3500 0.3500 0.3500 0.0500 0.0500 0.0500 0.0500)
(-50.0 0.3400 0.3400 0.3400 0.3400 0.2650 0.2650 0.2650 0.2650)
(-45.0 0.2250 0.2250 0.2250 0.2250 0.1550 0.1550 0.1550 0.1550)
(-40.0 0.1000 0.1000 0.1000 0.1000 0.1650 0.1650 0.1650 0.1650)
(-35.0 0.0800 0.0800 0.0800 0.0800 0.1400 0.1400 0.1400 0.1400)
(-30.0 0.0800 0.0800 0.0800 0.0800 0.1300 0.1300 0.1300 0.1300)
(-25.0 0.0750 0.0750 0.0750 0.0750 0.0600 0.0600 0.0600 0.0600)
(-22.0 0.0660 0.0660 0.0660 0.0660 0.0400 0.0400 0.0400 0.0400)
(-21.0 0.0630 0.0630 0.0630 0.0630 0.0300 0.0300 0.0300 0.0300)
(-20.0 0.0600 0.0600 0.0600 0.0600 0.0250 0.0250 0.0250 0.0250)
(-19.0 0.0600 0.0600 0.0600 0.0600 0.0125 0.0125 0.0125 0.0125)
(-18.0 0.0600 0.0600 0.0600 0.0600 -0.0000 -0.0000 -0.0000 -0.0000)
(-17.0 0.0600 0.0600 0.0600 0.0600 -0.0220 -0.0220 -0.0220 -0.0220)
(-16.0 -0.0000 -0.0000 -0.0000 -0.0000 -0.0380 -0.0380 -0.0380 -0.0380)
(-15.0 -0.0400 -0.0400 -0.0400 -0.0400 -0.0500 -0.0500 -0.0500 -0.0500)
(-14.0 -0.0350 -0.0350 -0.0350 -0.0350 -0.0475 -0.0475 -0.0475 -0.0475)
(-13.0 -0.0320 -0.0320 -0.0320 -0.0320 -0.0435 -0.0435 -0.0435 -0.0435)
(-12.0 -0.0300 -0.0300 -0.0300 -0.0300 -0.0410 -0.0410 -0.0410 -0.0410)
(-11.0 -0.0300 -0.0300 -0.0300 -0.0300 -0.0380 -0.0380 -0.0380 -0.0380)
(-10.0 -0.0300 -0.0300 -0.0300 -0.0300 -0.0350 -0.0350 -0.0350 -0.0350)
(-9.0 -0.0300 -0.0300 -0.0300 -0.0300 -0.0275 -0.0275 -0.0275 -0.0275)
(-8.0 -0.0300 -0.0300 -0.0300 -0.0300 -0.0225 -0.0225 -0.0225 -0.0225)
(-7.0 -0.0300 -0.0300 -0.0300 -0.0300 -0.0150 -0.0150 -0.0150 -0.0150)
(-6.0 -0.0300 -0.0300 -0.0300 -0.0300 -0.0075 -0.0075 -0.0075 -0.0075)
(-5.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(-4.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(-3.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(-2.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(-1.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(0.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(1.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(2.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(3.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(4.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(5.0 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000 0.0000)
(6.0 0.0300 0.0300 0.0300 0.0300 0.0075 0.0075 0.0075 0.0075)
(7.0 0.0300 0.0300 0.0300 0.0300 0.0150 0.0150 0.0150 0.0150)
(8.0 0.0300 0.0300 0.0300 0.0300 0.0225 0.0225 0.0225 0.0225)
(9.0 0.0300 0.0300 0.0300 0.0300 0.0275 0.0275 0.0275 0.0275)
(10.0 0.0300 0.0300 0.0300 0.0300 0.0350 0.0350 0.0350 0.0350)
(11.0 0.0300 0.0300 0.0300 0.0300 0.0380 0.0380 0.0380 0.0380)
(12.0 0.0300 0.0300 0.0300 0.0300 0.0410 0.0410 0.0410 0.0410)
(13.0 0.0320 0.0320 0.0320 0.0320 0.0435 0.0435 0.0435 0.0435)
(14.0 0.0350 0.0350 0.0350 0.0350 0.0475 0.0475 0.0475 0.0475)
(15.0 0.0400 0.0400 0.0400 0.0400 0.0500 0.0500 0.0500 0.0500)
(16.0 0.0000 0.0000 0.0000 0.0000 0.0380 0.0380 0.0380 0.0380)
(17.0 -0.0600 -0.0600 -0.0600 -0.0600 0.0220 0.0220 0.0220 0.0220)
(18.0 -0.0600 -0.0600 -0.0600 -0.0600 0.0000 0.0000 0.0000 0.0000)
(19.0 -0.0600 -0.0600 -0.0600 -0.0600 -0.0125 -0.0125 -0.0125 -0.0125)
(20.0 -0.0600 -0.0600 -0.0600 -0.0600 -0.0250 -0.0250 -0.0250 -0.0250)
(21.0 -0.0630 -0.0630 -0.0630 -0.0630 -0.0300 -0.0300 -0.0300 -0.0300)
(22.0 -0.0660 -0.0660 -0.0660 -0.0660 -0.0400 -0.0400 -0.0400 -0.0400)
(25.0 -0.0750 -0.0750 -0.0750 -0.0750 -0.0600 -0.0600 -0.0600 -0.0600)
(30.0 -0.0800 -0.0800 -0.0800 -0.0800 -0.1300 -0.1300 -0.1300 -0.1300)
(35.0 -0.0800 -0.0800 -0.0800 -0.0800 -0.1400 -0.1400 -0.1400 -0.1400)
(40.0 -0.1000 -0.1000 -0.1000 -0.1000 -0.1650 -0.1650 -0.1650 -0.1650)
(45.0 -0.2250 -0.2250 -0.2250 -0.2250 -0.1550 -0.1550 -0.1550 -0.1550)
(50.0 -0.3400 -0.3400 -0.3400 -0.3400 -0.2650 -0.2650 -0.2650 -0.2650)
(55.0 -0.3500 -0.3500 -0.3500 -0.3500 -0.0500 -0.0500 -0.0500 -0.0500)
(60.0 -0.4000 -0.4000 -0.4000 -0.4000 -0.2700 -0.2700 -0.2700 -0.2700)
(65.0 -0.4600 -0.4600 -0.4600 -0.4600 -0.1500 -0.1500 -0.1500 -0.1500)
(70.0 -0.1500 -0.1500 -0.1500 -0.1500 -0.4100 -0.4100 -0.4100 -0.4100)
(75.0 -0.4800 -0.4800 -0.4800 -0.4800 -0.3000 -0.3000 -0.3000 -0.3000)
(80.0 -0.2600 -0.2600 -0.2600 -0.2600 -0.2100 -0.2100 -0.2100 -0.2100)
(85.0 -0.4600 -0.4600 -0.4600 -0.4600 -0.3800 -0.3800 -0.3800 -0.3800)
(90.0 -0.5000 -0.5000 -0.5000 -0.5000 -0.4200 -0.4200 -0.4200 -0.4200)
(95.0 -0.2800 -0.2800 -0.2800 -0.2800 -0.4150 -0.4150 -0.4150 -0.4150)
(100.0 -0.4500 -0.4500 -0.4500 -0.4500 -0.4500 -0.4500 -0.4500 -0.4500)
(105.0 -0.2750 -0.2750 -0.2750 -0.2750 -0.4500 -0.4500 -0.4500 -0.4500)
(110.0 -0.4900 -0.4900 -0.4900 -0.4900 -0.1900 -0.1900 -0.1900 -0.1900)
(115.0 -0.5400 -0.5400 -0.5400 -0.5400 -0.3900 -0.3900 -0.3900 -0.3900)
(120.0 -0.5600 -0.5600 -0.5600 -0.5600 -0.5400 -0.5400 -0.5400 -0.5400)
(125.0 -0.4700 -0.4700 -0.4700 -0.4700 -0.4900 -0.4900 -0.4900 -0.4900)
(130.0 -0.4100 -0.4100 -0.4100 -0.4100 -0.4400 -0.4400 -0.4400 -0.4400)
(135.0 -0.4200 -0.4200 -0.4200 -0.4200 -0.5250 -0.5250 -0.5250 -0.5250)
(140.0 -0.4000 -0.4000 -0.4000 -0.4000 -0.4750 -0.4750 -0.4750 -0.4750)
(145.0 -0.5000 -0.5000 -0.5000 -0.5000 -0.3800 -0.3800 -0.3800 -0.3800)
(150.0 -0.3500 -0.3500 -0.3500 -0.3500 -0.3800 -0.3800 -0.3800 -0.3800)
(155.0 -0.3250 -0.3250 -0.3250 -0.3250 -0.3300 -0.3300 -0.3300 -0.3300)
(160.0 -0.2850 -0.2850 -0.2850 -0.2850 -0.3000 -0.3000 -0.3000 -0.3000)
(165.0 -0.2750 -0.2750 -0.2750 -0.2750 -0.3500 -0.3500 -0.3500 -0.3500)
(170.0 -0.4200 -0.4200 -0.4200 -0.4200 -0.4250 -0.4250 -0.4250 -0.4250)
(175.0 -0.2800 -0.2800 -0.2800 -0.2800 -0.3100 -0.3100 -0.3100 -0.3100)
(180.0 0.0250 0.0250 0.0250 0.0250 -0.0600 -0.0600 -0.0600 -0.0600)
